#include "main.h"

static struct trait_i
{
	const char*		name[2];
	const char*		text;
} trait_data[] = {
	{{"Brawn", "Мощь"}, "Отражает силу и выносливость персонажа."},
	{{"Finesse", "Мастерство"}, "Отражает координацию движений персонажа и его подвижность."},
	{{"Resolve", "Стойкость"}, "Измеряет силу воли персонажа."},
	{{"Wits", "Разум"}, "Показывает то, насколько быстро герой может думать, особенно в критических ситуациях."},
	{{"Panache", "Характер"}, "Это то \"нечто особенное\", то что выделяет Героя из толпы."},
};
assert_enum(trait, Panache);
getstr_enum(trait);
getinf_enum(trait);